<!-- 服务协议 -->
<template>
  <view>
    <NavBar title="服务协议" />
    <view class="priv">
      <h2 style="text-align: center; padding-bottom: 20rpx">
        诚达App服务协议
      </h2>
	  <p>生效日期：2026年1月1日</p>
      【审慎阅读】您在申请注册登录流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、与您约定法律适用和管辖的条款、其他以粗体下划线标识的重要条款。以上特别条款将以粗体下划线标识，您应重点阅读。如您对协议有任何疑问，可向平台客服咨询。
      <br />
      【签约动作】当您按照页面提示阅读并同意本协议、通过支付宝授权登录且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与
      诚达 达成一致，成为 诚达
      平台“用户”。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
      <br />
      【重要须知】如您选择接受本协议并使用 诚达 平台服务的，您与 诚达
      均应严格履行本协议所约定的各项内容，如发生争议或纠纷，双方可以友好协商解决；协商不成的，任何一方均可提请本协议签订地的人民法院管辖。
      <br />
      【特别提示】阅读协议的过程中，如您不同意接受本协议的任意内容，或者无法准确理解相关条款含义的，您应立即停止登录、使用或其他后续操作程序，并销毁所有许可软件副本。
      <br />
      
      第一条 立约目的和签约主体
      <br />
      1、为规范 诚达
      平台运营秩序，明确各方权利义务关系，保障各方合法权益，特制定本协议。
      <br />
      2、本协议由用户（以下亦简称“您”）与 诚达
      软件所有者及运营者北京诚博达网络科技有限责任公司（以下简称“本公司”或“ 诚达
      ”）共同签署。
      <br />
      第二条 协议生效和适用范围
      <br />
      1、您通过 诚达 平台页面点击确认或以其他方式选择接受本协议并按照 诚达
      登录程序成功登录，即表示您与 诚达
      已达成协议并同意接受本协议的全部约定内容。本协议自您点击确认之时起生效，在您使用
      诚达 服务期间持续有效。
      <br />
      2、本协议内容包括协议正文、《 诚达 隐私权条款》以及所有 诚达
      已经发布的或将来可能发布并采取合理途径提前七日通知您的各类规则、操作流程、行为规范等。
      诚达
      有权以修改、更新等方式调整本协议和相关规则的内容，相关内容将公布于网站上或以其他方式通知您。除非您明示并通知
      诚达 不愿接受调整后的内容并停止使用 诚达
      及相关服务，否则调整后的内容将于公布之日起七日后开始对您生效。
      <br />
      第三条 定义
      <br />
      1、“ 诚达
      ”：指北京诚博达网络科技有限责任公司旗下拥有并运营的商品交易平台。
      <br />
      2、“ 诚达 用户”：指享受 诚达
      服务的用户，应当具备中华人民共和国法律规定的与您行为相适应的完全民事权利能力和民事行为能力。如用户不满18周岁，则用户承诺其注册登录
      诚达
      已获得法定监护人的同意或由其法定监护人代为注册，如用户无法独立承担本协议法律责任的，其相应的法律责任由其法定监护人承担。
      <br />
      3、“用户注册”：是指用户进入 诚达
      ，通过支付宝账号授权登陆并必须绑定手机号，按 诚达
      要求填写相关信息并确认同意履行相关服务协议的过程。
      <br />
      第四条 诚达 客户端授权范围
      <br />
      1、 诚达 基于本协议许可而非向您销售 诚达
      客户端（以下简称“许可软件”），用户仅可依照本协议约定使用许可软件。 诚达
      保留未明示授予的一切权利。 诚达
      有权根据实际情况对许可软件及其相关功能进行变更、升级、修改或转移，并有权在许可软件系统中开发新的功能或其他服务，并不另行通知于您。除非附有独立的协议，否则上述所有新的功能、软件服务的提供仍适用本协议。
      <br />
      2、除您与 诚达 另有约定外，您同意 诚达
      客户端的服务及相关的数据仅供您个人非商业性质的使用，或者将 诚达
      作为从事商业活动的场所、平台或其他任何形式的媒介。您不得对许可软件服务的任何部分或对其使用及获得进行复制、拷贝、出售或利用许可软件服务进行调查、广告或将许可软件服务用于其他任何商业目的，也不得对许可软件或者许可软件运行过程中释放在任何终端中的数据及许可软件运行过程中终端与服务器端的交互数据进行复制、更改、修改、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经授权的第三方工具/服务接入许可软件和相关系统。但
      诚达 对特定服务另有使用指引或规则的除外。
      <br />
      3、用户不得开发或委托第三方开发/使用应用软件或程序侵入 诚达
      平台系统进行批量信息的抓取、下载或进行违背甲方平台产品规则的操作，否则甲方有权全额扣除乙方缴纳的保证金（如有）或者直接抵扣用户在
      诚达 平台的交易款项并要求乙方对给甲方造成的全部损失承担赔偿责任。
      <br />
      4、用户不得对许可软件的相关信息擅自出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点，借助许可软件发展与之有关的衍生产品、作品、服务、插件、外挂、兼容、互联等；不得删除许可软件及其他副本上关于版权的信息、内容；不得进行任何危害信息网络安全的行为，包括使用许可软件时以任何方式损坏或破坏许可软件或使其不能运行或超负荷或干扰第三方对许可软件的使用；不得进行未经允许进入他人软件系统并删除、修改、增加存储信息；不得故意传播恶意程序或病毒以及其他破坏、干扰正常网络信息服务的行为；不得利用许可软件发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容，或从事欺诈、盗用他人账户、资金等违法犯罪活动。
      <br />
      5、 诚达 平台向您提供的服务付出了大量的成本，除 诚达
      平台明示的收费业务外， 诚达 向您提供的服务目前是免费的。如未来 诚达
      向您收取合理费用， 诚达
      会采取合理途径并以足够合理的期限提前通过法定程序并以本协议约定的方式通知您，确保您有充分选择的权利。
      <br />
      第五条 诚达 平台服务及规范
      <br />
      1、您有权在 诚达
      平台上享受二手及闲置物品及/或服务的销售与推广、二手及闲置物品及/或服务的购买与评价、交易争议处理等服务。
      <br />
      2、您应当确保您对您在 诚达
      平台上发布的商品及/或服务享有相应的权利，您不得在 诚达
      平台上销售以下商品及/或提供以下服务：
      <br />
      （一）国家禁止或限制的；
      <br />
      （二）侵犯他人知识产权或其它合法权益的；
      <br />
      （三） 诚达
      平台规则、公告、通知或各平台与您单独签署的协议中已明确说明不适合在 诚达
      平台上销售及/或提供的。
      <br />
      3、当您在 诚达
      平台购买商品及/或服务时，请您务必仔细确认所购商品的品名、价格、数量、型号、规格、尺寸或服务的时间、内容、限制性要求等重要事项，并在下单时核实您的联系地址、电话、收货人等信息。如您填写的收货人非您本人，则该收货人的行为和意思表示产生的法律后果均由您承担。您的购买行为应当基于真实的消费需求，不得存在对商品及/或服务实施恶意购买、恶意维权等扰乱
      诚达 平台正常交易秩序的行为。基于维护 诚达 平台交易秩序及交易安全的需要，
      诚达 发现上述情形时可主动执行关闭相关交易订单等操作。
      <br />
      4、您有权在 诚达
      平台提供的评价系统中对与您达成交易的其他用户商品及/或服务进行评价。您应当理解，您在
      诚达
      平台的评价信息是公开的，如您不愿意在评价信息中向公众披露您的身份信息，您有权选择通过匿名形式发表评价内容。您的所有评价行为应遵守
      诚达
      平台规则的相关规定，评价内容应当客观真实，不应包含任何污言秽语、色情低俗、广告信息及法律法规与本协议列明的其他禁止性信息；您不应以不正当方式帮助他人提升信用或利用评价权利对其他用户实施威胁、敲诈勒索。
      诚达 可按照 诚达
      平台规则的相关规定对您实施上述行为所产生的评价信息进行删除或屏蔽。
      <br />
      5、平台担保服务：用户知悉并同意，当用户因交易发生在线支付时，本平台接受卖方委托通过
      诚达
      钱包账户代为收取交易款项，并在买方在线确认“已收货”或本平台约定的交易期限届满时接受买方委托将该交易款项支付至卖方
      诚达
      钱包账户，或卖方确认该笔交易已取消时接受卖方委托将该交易款项退回至买方
      诚达
      钱包账户。在线交易双方就交易事项无法达成一致意见期间，交易双方一致同意由
      诚达 将该笔交易款项暂时冻结在 诚达
      钱包账户直至双方达成一致意见并根据双方的共同意愿支付。特殊情形下， 诚达
      将可能在您确认购买且付款后立即付款给卖家，具体以平台另行制定并与您签署的协议约定为准。交易双方用户同意,
      诚达 支付宝账户代付后, 非经法律程序或者本协议之约定,
      该支付是不可撤销的， 诚达
      的支付行为视为经买卖双方的共同授权代为支付的行为。
      <br />
      6、用户知悉并同意，平台担保服务仅为防止买卖双方因脱离平台线下支付导致的欺诈被骗、敲诈勒索等人身及钱财损失的情形，并非
      诚达
      对交易任一方做出的任何关于商品及交易情况的言行进行审核并提供质量或者履行能力相关的担保或保证，交易双方应自行对交易行为承担全部责任。
      <br />
      7、检验评估服务：指 诚达 及 诚达
      合作的第三方向卖家提供的对买家拟购买的商品（包括3C电子产品、奢侈品等）进行质量检验并提供评估报告供买卖双方作为交易的参考，不同场景项下，对于经检测评估的物品，
      诚达 及 诚达
      合作的第三方可能对该物品提供30天至180天不等的质保服务，具体以平台展示为准。用户知悉并同意，
      诚达 提供的检验服务项目将以检验评估报告的形式展示，如因 诚达
      评估报告原因出现买家收到的商品与报告描述不符的， 诚达
      仅向买家承担退款退货或维修的保障服务。对于超出检验评估报告的项目、 诚达
      检验评估规则已明示不属于检验范围的项目以及卖家对此物品/服务做出的其他承诺或保证，
      诚达
      不予检测且不提供任何保障服务，具体以您收到的实物为准，并由卖方对此承担全部责任。
      <br />
      8、您知悉并了解，本平台所展示的物品/服务均为卖方以非盈利为目的进行转让，故除买卖双方另有约定及物品/服务确实存在质量问题外，概不支持7天无理由退货。且鉴于物品/服务交易纠纷及风险高于普通物品/服务交易，
      诚达
      用户需对交易细节进行详细、客观的沟通约定，并遵守相应的约定事项。若因交易约定不详导致的交易纠纷，除法律另有明确规定外，由
      诚达 用户自行承担风险和责任。
      <br />
      9、您知悉并了解，鉴于线下见面交易存在较大的人身财产安全及交易纠纷风险，
      诚达 推荐您使用 诚达
      平台担保交易服务。如您脱离平台担保交易而选择线下见面交易的，交易双方在线下交易中应尽到合理的谨慎注意义务，买方有权要求卖方提供真实身份信息（包括但不限于身份证、姓名、联系方式、地址等）并对购买的商品/服务进行审查、验货合格后再行支付交易价款。如因线下见面交易产生纠纷及风险，除法律另有明确规定外，由您自行承担全部损失和责任。您理解并同意，此等情况下，
      诚达
      仅作为单纯的信息发布平台，既未参与双方的交易，亦未就交易活动收取费用，对您因线下交易产生的纠纷/责任/索赔等免责。
      <br />
      10、用户在 诚达
      上交易过程中如与其他用户因交易产生争议/纠纷的，可以选择以下途径解决：（1）与争议相对方自主协商；（2）使用
      诚达
      平台提供的争议调处（亦称“客服介入”）服务；（3）请求消费者协会或者其他依法成立的调解组织调解；（4）根据与争议相对方达成的仲裁协议（如有）提请仲裁机构仲裁；（5）向人民法院提起诉讼。
      <br />
      11、如您依据 诚达 相关规则选择使用 诚达
      提供的争议调处服务，则表示您认可并愿意履行 诚达
      客服作为独立的第三方根据其所了解到的争议事实并依据 诚达
      相关规则所作出的调处决定（包括调整相关订单的交易状态、判定将争议款项的全部或部分支付给交易一方或双方等）。您知悉并同意：
      诚达
      客服介入做出的调处决定并非国家公权力机关的终局裁决，您仍有权利就交易纠纷采取其他合法途径维护您的合法权益。
      诚达 不保证争议处理结果符合您的期望，除因 诚达
      单方原因故意或重大过失导致您产生损失的情况外， 诚达 不对依据 诚达
      相关规则做出的争议处理结果承担责任。
      <br />
      第六条 用户权利和义务
      <br />
      1、您在使用 诚达
      平台服务时，您需要凭您的支付宝账户授权登录许可软件并绑定合法有效的手机号码。
      诚达
      仅根据您的支付宝账户和绑定的手机号码确认使用许可软件者的身份。您应妥善保管您的支付宝账户、手机号码和验证码，并对其使用或遗失自行承担责任。
      诚达 账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果， 诚达
      并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。
      <br />
      2、如果您的支付宝账户和手机号码存在未获授权的使用，或者发生其他任何安全问题时，建议您立即通知
      诚达 。除法律另有明确规定外， 诚达
      对因上述情形产生的后果不承担责任。您理解 诚达
      对您的任何请求采取行动均需要合理时间，且 诚达
      应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除 诚达
      存在法定过错外， 诚达 不承担责任。
      <br />
      3、您在使用 诚达 服务时须向 诚达
      提供准确的个人资料信息，您保证您填写及提交的前述资料信息真实、准确、合法、有效，如有任何变更须及时更新。
      诚达
      有权对您在注册登录环节填写或提交的资料信息进行备案，且保留抽查、要求您补充提交、及时更新的权利。在法律有明确规定要求
      诚达
      作为平台服务提供者必须对部分用户（如平台卖家等）的信息进行核实的情况下，
      诚达
      将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整、有效的信息。
      <br />
      4、如 诚达 按您最后一次提供的信息与您联系未果、您未按 诚达
      的要求及时提供/更新信息、您提供的信息存在明显不实或行政司法机关核实您提供的信息无效的，您将承担因此对您自身、他人及
      诚达 造成的全部损失与不利后果。 诚达
      可向您发出询问或要求整改的通知，并要求您进行重新认证，直至中止、终止对您提供部分或全部
      诚达 平台服务， 诚达 对此不承担责任。
      <br />
      5、用户保证不以他人资料在 诚达
      进行注册（包括但不限于使用他人的微信账户、支付宝账户或者手机号码或者身份信息）、登录,
      否则由此产生的全部不利责任将全部由用户自身承担；用户理解并同意， 诚达
      有权应政府部门（包括司法及行政部门）的要求，向其提供用户在 诚达
      填写的注册信息和交易记录等必要信息。
      <br />
      6、为了确保用户身份信息的真实及持续有效， 诚达
      会在不同场景中要求您进行实名认证（实名认证是由 诚达
      平台提供的一项个人身份认证服务，通过与公安网数据校验并使用全球领先的人脸识别技术，保障个人身份真实性，您不得使用虚假或者无效身份信息进行实名认证。
      <br />
      7、您需确保自己对在 诚达
      发布的内容是您原创或已获得有效、完全的授权，不会侵犯任何主体的肖像权、名誉权、知识产权、隐私权等合法权益，也不会侵犯法人或其他团体的商标权、商业秘密等合法权益，不违反国家法律法规及本平台的规定。如因此引起纠纷，
      诚达 有权直接立即删除或屏蔽该内容并要求您赔偿全部损失。您应确保您通过 诚达
      提交、发布的全部信息（包括但不限于个人信息、商品信息、言论及所作出的行为等）不包含以下内容：（1）违反国家法律法规、破坏国家统一、煽动民族仇恨、民族歧视、破坏民族团结的；（2）损害国家机关信誉、进行政治宣传或破坏国家宗教政策的；（3）宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖或教唆犯罪的；（4）侮辱、诽谤、恐吓、散播涉及他人隐私等侵害他人合法权益的；（5）捏造或歪曲事实，从事欺诈、虚假、不准确或误导性行为，扰乱社会秩序、平台交易秩序的；（6）侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；（7）存在可能破坏、篡改、删除、影响
      诚达 任何系统正常运行或未经授权秘密获取 诚达
      及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；（8）其他违背社会公共利益或公共道德的。
      <br />
      8、 诚达 平台只允许每位用户使用一个 诚达
      平台账户。用户不得通过任何手段恶意注册 诚达
      帐号，包括但不限于以牟利、炒作、套现、获奖等为目的多个账号注册；不得盗用其他用户帐号；未经
      诚达 明确书面许可，亦不得转让、出租或者售卖E专硕账号。如有证据证明或 诚达
      平台有理由相信您存在不当注册或不当使用多个 诚达 平台账户的情形， 诚达
      有权直接采取一切必要的措施，包括但不限于删除用户发布的内容、取消用户在平台获得的星级、荣誉以及虚拟财富，暂停、查封、冻结或关闭用户帐号，取消交易及因违规所获利益，拒绝提供服务等，乃至通过诉讼形式追究用户法律责任等。如给
      诚达 平台及相关方造成损失的，您还应承担赔偿责任。
      <br />
      9、用户应当保证在使用 诚达
      平台进行交易的过程中遵守国家法律法规等规范文件及 诚达
      平台各项规则的规定和要求，不损害他人的合法权益，不在交易过程中采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与交易无关的行为；用户在使用
      诚达
      服务过程中所产生的运费、应纳税费（含发票开具等），以及其他相关费用，均由用户独自承担。用户如发现其他用户有违法或违反本协议的行为，可以向
      诚达 进行反映并建议处理。
      <br />
      第七条 诚达 的权利和义务
      <br />
      1、对于用户在 诚达 平台上的不当行为或其它任何 诚达
      认为应当终止服务的情况， 诚达
      有权随时作出删除相关信息、终止服务等处理，而无须征得用户的同意。
      <br />
      2、凡有用户恶意注册（为达到某种不正当的目的，进行非正常注册）E专硕帐号或产生作弊/虚假交易一经发现，
      诚达
      均有权取消该用户在本平台的一切权利、权益，包括但不限于注销该用户相关信息、冻结其帐号、停止所有服务等处理，而无须征得用户的同意，因此造成的全部后果和损失由用户独立承担。
      <br />
      3、因 诚达 平台的特殊性， 诚达
      对所有用户的注册登录信息会进行审核，如存在下列情况之一的， 诚达
      有权根据不同情况选择保留或删除相关信息或继续、停止对该用户提供服务，并追究相关法律责任。（1）用户或其它第三方通知
      诚达 ，认为某个具体用户或具体事项可能存在重大问题；（2）用户或其他第三方向
      诚达 投诉举证E专硕平台上有违法或不当行为的， 诚达
      以普通非专业知识水平标准对相关内容进行判别，可以明显认为这些内容或行为具有违法或不当性质的。
      <br />
      4、经国家生效法律文书或行政处罚决定确认用户存在违法行为，或者 诚达
      有足够事实依据可以认定用户存在违法或违反服务协议行为的， 诚达
      有权在E专属平台及所在网站上以网络发布形式公布用户的违法行为，以提示其他用户注意判断评估交易风险。
      <br />
      5、对于用户在 诚达 平台发布的部分不合理信息， 诚达
      有权在不通知用户的前提下进行删除、屏蔽或采取其它限制性措施。此类不合理信息包括但不限于：（1）以进行商业代购或商业买卖为目的信息；（2）以炒作不实信用为目的的信息；（3）
      诚达 有理由相信存在欺诈等恶意或虚假内容的信息；（4） 诚达
      有理由相信与物品交换无关或不是以交换为目的的信息（5） 诚达
      有理由相信存在恶意扰乱正常秩序因素的信息；（6） 诚达
      有理由相信该信息违反公共利益或可能严重损害 诚达 和其它用户合法利益的。
      <br />
      第八条 侵权投诉
      <br />
      1、据《中华人民共和国侵权责任法》第三十六条，任何第三方认为，用户利用 诚达
      平台侵害本人民事权益或实施侵权行为的，包括但不限于侮辱、诽谤等，被侵权人有权书面通知
      诚达 采取删除、屏蔽、断开链接等必要措施。
      <br />
      2、任何第三方（包括但不限于企业、单位或个人等）认为E专硕用户发布的任何信息侵犯其合法权益的，在有充分法律法规及证据足以证明的情况下，可以通过下列发送电子邮件方式通知
      诚达 ，具体邮箱为274762046@qq.com。
      <br />
      3、侵权投诉必须包含以下信息：（1）被侵权人的姓名（名称）、联系方式、地址、电子邮件等；（2）侵权的具体信息网址、编号或其他可以找到该信息的细节；（3）您是所述的版权或者其他权利的合法拥有者的权利证明；（4）您的身份证复印件、营业执照等其他相关资料。（5）投诉内容须纳入以下声明：“本人本着诚信原则，有证据认为该对象侵害本人或他人的合法权益。本人承诺投诉全部信息真实、准确，否则自愿承担一切后果。”
      （6）本人亲笔签字并注明日期，如代理他人投诉的，必须出具授权人签字的授权书。
      <br />
      第九条 信息获取及保护
      <br />
      1、 诚达
      非常重视用户个人信息（即以电子或者其他方式记录的能够单独或与其他信息结合识别特定用户身份的信息）保护，在您使用
      诚达 提供的服务时，您同意遵守 诚达 平台公布并不时修订的隐私权条款，《 诚达
      隐私条款》构成本协议的有效组成部分，亦同意 诚达
      按照隐私权条款手机、存储、使用、披露和保护您的个人信息。
      <br />
      2、您知悉并同意，为向您提供更安全的服务，在适用法律允许的范围内， 诚达
      可能为安全目的采取必要的技术手段获取您在使用 诚达 软件过程中的相关信息。
      <br />
      第十一条 知识产权保护
      <br />
      1、任何用户接受本协议，即表明该用户主动将其在任何时间段在本平台上传、发布的任何形式的信息内容（包括但不限于图片、音频、视频、商品咨询及评价、各类话题文章等）的财产性权利等任何可转让的权利，如著作财产权，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权等，以及应当由著作权人享有的其他可转让权利无偿独家且不可撤销地转让给
      诚达 运营者所有，同时表明该用户许可 诚达
      有权利就任何主体侵权而单独提起诉讼，并获得全部赔偿。本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律所规定的著作财产权等权利转让书面协议，其效力及于用户在
      诚达
      发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。用户同意并明确了解上述条款，不将已发表于本平台的信息，以任何形式发布或授权其它网站（及媒体）使用。
      <br />
      2、 诚达 许可软件的一切版权、商标权、专利权、商业秘密以及与 诚达
      相关的所有信息内容包括但不限于作品、图片、文字表述及其组合、音频、视频、图标、档案资料、网站构架、网站版面框架、网页设计、有关数据、印刷材料、电子文档等，均受中华人民共和国著作权法、商标法、专利法、反不正当竞争法和相应国际条约以及其他知识产权法律法规的保护，除涉及第三方授权的软件或技术外，
      诚达 享有上述知识产权。未经 诚达
      书面同意，任何人不得为任何营利性或非营利性的目的自行使用（包括但不限于以非法方式复制、传播、展示、镜像、上载、下载、修改、出租、出借、出售、散布
      诚达
      平台的上述任何资料和资源，或根据上述资料和资源制作成任何种类产品）、转让或者许可任何第三方使用、转让上述知识产权。
      诚达 保留追究上述未经许可行为的法律责任的权利。
      <br />
      3、本公司是 诚达
      平台的制作者,拥有此平台内容及资源的版权,受国家知识产权保护,享有对本平台各种协议、声明的修改权。除法律另有强制性规定外，未经
      诚达
      的明确书面许可，任何第三方不得为任何私人或商业目的获取或使用本平台的任何部分或通过本平台可直接或间接获得的任何内容、服务或资料。任何第三方违反本协议的规定以任何方式，和/或以任何文字对本平台的任何部分进行发表、复制、转载、更改、引用、链接、下载、抓取或以其他方式进行使用，或向任何其他第三方提供获取本平台任何内容的渠道，则对本平台的使用权将立即终止，且任何第三方必须按照本公司的要求，归还或销毁使用本平台任何部分的内容所创建的资料的任何副本。
      <br />
      4、 诚达
      未向任何第三方转让本网站或其中的任何内容所相关的任何权益或所有权，且一切未明确向任何第三方授予的权利均归
      诚达
      所有。未经本协议明确允许而擅自使用本平台任何内容、服务或资料的，构成对本协议的违约行为，且可能触犯著作权、商标、专利和/或其他方面的法律法规，
      诚达
      保留对任何违反本协议规定的第三方（包括单位或个人等）提起法律诉讼的权利。
      <br />
      第十二条 违约责任
      <br />
      1、您应理解按本协议约定使用 诚达
      ，按规范使用许可软件、按本协议约定履行义务是您获取 诚达 授权使用软件、提供
      诚达 服务的前提，如您严重违反本协议， 诚达
      将终止提供服务，本协议终止。在本使用许可终止时，您应停止对许可软件的使用行为,
      并销毁许可软件的全部副本。您在协议终止前的行为所导致的任何责任，您应完全且独立地承担。
      <br />
      2、一旦您违反本协议， 诚达
      有权对您的权益采取限制措施，包括中止、终止对您提供部分或全部服务，且在经营或实际控制的平台依法公示您的违约情况。
      <br />
      3、如您违反法律法规或本协议约定的条款，给其他用户造成损失或使 诚达
      遭受任何损失/受到任何第三方的索赔/受到任何行政管理部门的处罚的，您必须承担全部的赔偿责任。如
      诚达 因此向第三方进行了赔偿或补偿，则您同意赔偿 诚达
      的相关支出和损失，包括合理的律师费用。同时， 诚达
      有权依据本协议的约定，对用户的账户及发布的信息做出相应处理措施，包括但不限于直接屏蔽、删除侵权信息或直接关闭账号、停止服务，且无须征得您的同意或提前通知您。
      <br />
      4、当您违约的同时存在欺诈、售假、盗用他人账户等特定情形或您存在危及他人交易安全或账户安全风险时，
      诚达
      会依照您行为的风险程度对您的账户采取取消收款、资金止付等强制措施。同时
      诚达
      可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在
      诚达 平台上予以公示。
      <br />
      5、 诚达
      有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并据此采取相应的处理措施。对于用户涉嫌违反本协议承诺/约定的行为对任意第三方造成损害的，用户均应当以自己的名义独立承担所有的法律责任，并应确保
      诚达 免于承担因此产生的损失或增加的费用。
      <br />
      6、您在 诚达 平台上发布的信息构成违约的， 诚达
      可根据相应规则立即对相应信息进行删除、屏蔽处理或对您的商品进行下架、监管。您在
      诚达 平台上实施的行为，或虽未在 诚达 平台上实施但对 诚达
      平台及其用户产生影响的行为构成违约的， 诚达
      可依据相应规则对您执行账户扣分、限制参加营销活动、中止向您提供部分或全部服务、划扣违约金等处理措施。如您的行为构成根本违约的，
      诚达 可查封您的账户，终止向您提供服务。
      <br />
      第十三条 协议终止
      <br />
      1、您有权通过以下任一方式终止本协议：（1）在满足 诚达
      平台公示的账户注销条件时您通过网站自助服务注销您的账户的；（2）变更事项生效前您停止使用并明示不愿接受变更事项的；（3）您明示不愿继续使用
      诚达 平台服务，且符合 诚达 平台终止条件的。
      <br />
      2、出现以下情况时， 诚达
      可以通过以下方式通知您终止本协议：（1）您违反本协议约定， 诚达
      依据违约条款终止本协议的；（2）您盗用他人账户、发布违禁信息、骗取他人财物、售假、扰乱市场秩序、采取不正当手段谋利等行为，
      诚达 依据 诚达
      平台规则对您的账户予以查封的；（3）除上述情形外，因您多次违反 诚达
      平台规则相关规定且情节严重， 诚达 依据 诚达
      平台规则对您的账户予以查封的；（4）您的账户被 诚达
      依据本协议回收的；（5）您在 诚达
      平台有欺诈、发布或销售假冒伪劣/侵权商品、侵犯他人合法权益或其他严重违法违约行为的；（6）其它应当终止服务的情况。
      <br />
      3、本协议终止后，除法律有明确规定外， 诚达
      无义务向您或您指定的第三方披露您账户中的任何信息。本协议终止后， 诚达
      仍享有下列权利：（1）继续保存您留存于 诚达
      平台的各类信息；（2）对于您过往的违约行为， 诚达
      仍可依据本协议向您追究违约责任。
      <br />
      4、本协议终止后，对于您在本协议存续期间产生的交易订单， 诚达
      可通知交易相对方并根据交易相对方的意愿决定是否关闭该等交易订单；如交易相对方要求继续履行的，则您应当就该等交易订单继续履行本协议及交易订单的约定，并承担因此产生的任何损失或增加的任何费用。
      <br />
      第十四条 通知
      <br />
      1、您在注册成为 诚达 平台用户，并接受 诚达 平台服务时，您应该向 诚达
      提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。您在注册
      诚达 平台用户时生成的用于登陆 诚达
      平台接收站内信、系统消息和私信息的账号，也作为您的有效联系方式。
      <br />
      2、 诚达
      将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。
      <br />
      3、 诚达
      通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在
      诚达
      平台公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送私信信息、系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。
      <br />
      4、对于在 诚达
      平台上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件或
      诚达
      私信等现代通讯方式或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱或
      诚达 私信等联系方式为您在 诚达
      平台注册、更新时提供的手机号码、电子邮箱联系方式以及在注册 诚达 用户时生成
      诚达
      账号，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。
      <br />
      5、您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。
      <br />
      6、你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。
      <br />
      第十五条 其他约定
      <br />
      1、本协议适用中华人民共和国大陆地区法律。因 诚达
      与用户就本协议所引起或与其有关的任何争议应由协议签订地的人民法院管辖。因级别管辖的规定，注册地人民法院无管辖权的，以其上级法院作为第一审管辖法院。
      <br />
      2、任一方未经对方同意，不得将协议权利义务转让第三方。 诚达
      可基于服务需要，变更或增加履约主体，此等变更不会影响您在本协议项下的权益。如您继续使用
      诚达
      服务的，视为同意变更后的主体或新增的主体作为与您履约的相对方。上述主体的变更
      诚达 将通过页面公告等方式向您发出通知。
      <br />
      3、本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
    </view>
  </view>
</template>

<script lang="ts" setup>
import NavBar from "components/NavBar.vue";
</script>

<style lang="scss">
.priv {
  background-color: #f5f6f7;
  padding: 20rpx;
  font-size: 24rpx;
  line-height: 40rpx;
  letter-spacing: 2rpx;
}
</style>
